// ให้เขียนโค้ดเพื่อหาจำนวนเฉพาะตั้งแต่ 1 ถึง 100

// 1. (i==1 || i%2 == 0 || i%3 == 0 || i%5==0 || i%7==0) คือ ตรวจสอบว่าตัวแปร i (ค่าตัวเลข) มีค่าเป็น 1 หรือ %(Mod – หารเอาเศษ) ด้วย 2 หรือ 3 หรือ 5 หรือ 7 มีค่าเป็น 0(ศูนย์) หรือไม่ ถ้าใช่เงื่อนไขที่ (1.) จะเป็นจริง

// 2. (i!=2 && i!=3 && i!=5 && i!=7) คือ ตรวจสอบว่าตัวแปร i (ค่าตัวเลข) ไม่เท่ากับ 2 และ 3 และ 5 และ 7 ถ้าใช่เงื่อนไขที่ (2.) จะเป็นจริง

for (let i = 1; i <= 100; i++) {
    if((i == 1 || i % 2 == 0 || i % 3 == 0 || i % 5 == 0 || i % 7 == 0) && 
    (i != 2 && i != 3 && i != 5 && i != 7)) continue;

    console.log(i);
}